## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                     |
|--------|----------------------------------------------|
| add    | `aws_route53_record.qualtrics-cds-snc-CNAME` |
|        | `aws_route53_record.qualtrics-cds-snc-TXT`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.qualtrics-cds-snc-CNAME will be created
  + resource "aws_route53_record" "qualtrics-cds-snc-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "experience.cds-snc.ca"
      + records         = [
          + "cdssnc-primary.vanitydomains.qualtrics.com",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.qualtrics-cds-snc-TXT will be created
  + resource "aws_route53_record" "qualtrics-cds-snc-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "experience._domainkey.cds-snc.ca"
      + records         = [
          + "v=DKIM1; k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCDdwCodgUYxC4dYhuCicba5NvtCYPDMTkcL5iOrSGXBCX7AZ1wykjTJr5s5ZJZqIaUjigx4qp6rY7o3xO/2EL5+ldET3gk/h6MsoTSF7pRE5vsGFdmO4mIG6Vi7EBG+z1FAPsWQf0QvFGktHGkXkBGIZzA1eH56G7qj2IewufcBwIDAQAB",
        ]
      + ttl             = 1800
      + type            = "TXT"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
